---
kind: property
id: P:Autodesk.Revit.DB.Events.FileExportingEventArgs.Format
source: html/b5b907f4-d92e-d708-f354-e393f45c1bfb.htm
---
# Autodesk.Revit.DB.Events.FileExportingEventArgs.Format Property

Identifies the export format, e.g. DWG or image.

## Syntax (C#)
```csharp
public ImportExportFileFormat Format { get; }
```